Revit 2027 API
BuiltInFailures.StairRampFailures.ExtendBelowBaseGreaterThanRunTopElevation Property
 Extend Below Base needs to be less than Run Top Elevation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ExtendBelowBaseGreaterThanRunTopElevation { get; }
Public Shared ReadOnly Property ExtendBelowBaseGreaterThanRunTopElevation As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ExtendBelowBaseGreaterThanRunTopElevation {
	FailureDefinitionId^ get ();
}
static member ExtendBelowBaseGreaterThanRunTopElevation : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace